# GetMaximumIndentLevel Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormattedText..::..GetMaximumIndentLevel Method
FormattedText Class See Also
---
Returns the maximum allowed indent level
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public int GetMaximumIndentLevel()
```

Visual Basic
---
```text
Public Function GetMaximumIndentLevel As Integer
```

Visual C++
---
```text
public:
int GetMaximumIndentLevel()
```

# See Also
FormattedText Class
Autodesk.Revit.DB Namespace